const config = require('../config')
const { cmd, commands } = require('../command');
const os = require("os")
const { runtime } = require('../lib/functions')
const axios = require('axios')

cmd({
    pattern: "menu",
    use: '.menu',
    category: "main",
    desc: "main menu with bot status and commands",
    react: "📃",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, pushname, reply }) => {
    try {
        let status = `*╭━━〘 ＤＥＶＩＬ ＴＥＣＨ ＭＤ 〙━━●●►*
*┃➩╭─────────────────·๏*
*┃➩┃ 👋 Usᴇʀ Nᴀᴍᴇ* : *${pushname}*
*┃➩┃ 📅 Ｄᴀᴛᴇ : ${currentDate}*
*┃➩┃ ⌚ Ｔɪᴍᴇ : ${currentTime}*
*┃➩┃ ❗ Uᴘ Tɪᴍᴇ -* *${runtime(process.uptime())}*
*┃➩┃ ❗ Rᴀᴍ Uꜱᴇɢᴇ -* *${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(os.totalmem() / 1024 / 1024)}MB*
*┃➩┃ ⚙️ Cʀᴇᴀᴛᴏʀ* : *ᴄʏʙᴇʀ ʟᴏᴋᴜ ᴀꜱʜᴜᴜ ᴏꜰᴄ*
*┃➩┃ 🎭 Vᴇʀsɪᴏɴ* : *v1.0.0*
*┃➩└────────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━━━●●►*

*╭━━〘 ＭＡＩＮ ＣＯＭＭＡＮＤＳ 〙━━►*
*┃❖╭──────────────────·๏*
*┃❖┃•  1. Ｍᴇɴᴜ*
*┃❖┃•  2. Ｍᴇɴᴜ2*
*┃❖┃•  3. Ｍᴇɴᴜ3*
*┃❖┃•  4. Ｒᴇꜱᴛᴀʀᴛ*
*┃❖┃•  5. Ａʏꜱᴛᴇᴍ*
*┃❖┃•  6. Ａʟɪᴠᴇ*
*┃❖┃•  7. Ａʟɪᴠᴇ2*
*┃❖┃•  8. Ａʙᴏᴜᴛ*
*┃❖┃•  9. Ｐɪɴɢ*
*┃❖┃• 10. Ｐɪɴɢ2*
*┃❖┃• 11. Ｖᴇʀꜱɪᴏɴ*
*┃❖┃• 12. Ｒᴇᴘᴏ*
*┃❖┃• 13. Ｏᴡɴᴇʀ*
*┃❖┃• 14. Ｓᴇᴛᴛɪɴɢ*
*┃❖└────────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━━━━►*

*╭━━〘 ＤＯＷＮＬＯＡＤ ＣＭＤＳ 〙━━►*
*┃❖╭──────────────────·๏*
*┃❖┃• 15. Ｆᴀᴄᴇʙᴏᴏᴋ < ᴜʀʟ >*
*┃❖┃• 16. Ｔɪᴋᴛᴏᴋ < ᴜʀʟ >*
*┃❖┃• 17. Ｉɴꜱᴛᴀ < ᴜʀʟ >*
*┃❖┃• 18. Ｇᴅʀɪᴠᴇ < ᴜʀʟ >*
*┃❖┃• 19. Ｔᴡɪᴛᴛᴇʀ < ᴜʀʟ >*
*┃❖┃• 20. Ｍᴇᴅɪᴀғɪʀᴇ < ᴜʀʟ >*
*┃❖┃• 21. Ａᴘᴋ < ɴᴀᴍᴇ >*
*┃❖┃• 22. Ｓᴏɴɢ <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 23. Ｓᴏɴɢ2 <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 24. Ｓᴏɴɢ3 <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 25. Ｖᴏɪᴄᴇ <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 26. Ｖɪᴅᴇᴏ <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 27. Ｖɪᴅᴇᴏ2 <ʏᴛ ᴠɪᴅᴇᴏ ɴᴀᴍᴇ ᴏʀ ᴜʀʟ>*
*┃❖┃• 28. Ｘᴠɪᴅᴇᴏ < ɴᴀᴍᴇ ᴏʀ ᴜʀʟ >*
*┃❖┃• 29. Ｌʏʀɪᴄs < ɴᴀᴍᴇ >*
*┃❖┃• 30. Ｍᴏᴠɪᴇ < ɴᴀᴍᴇ >*
*┃❖└────────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━━━━►*

*╭━━━〘 ＬＯＧＯ ＬＩＳＴ 〙━━━►*
*┃❖╭───────────────·๏*
*┃❖┃• 31. Ｎᴇᴏɴʟɪɢʜᴛ*
*┃❖┃• 32. Ｂʟᴀᴄᴋᴘɪɴᴋ*
*┃❖┃• 33. Ｄʀᴀɢᴏɴʙᴀʟʟ*
*┃❖┃• 33. 3Ｄᴄᴏᴍɪᴄ*
*┃❖┃• 34. Ａᴍᴇʀɪᴄᴀ*
*┃❖┃• 35. Ｎᴀʀᴜᴛᴏ*
*┃❖┃• 36. Ｓᴀᴅɢɪʀʟ*
*┃❖┃• 37. Ｃʟᴏᴜᴅꜱ*
*┃❖┃• 38. Ｆᴜᴛᴜʀɪꜱᴛɪᴄ*
*┃❖┃• 39. 3Ｄᴘᴀᴘᴇʀ*
*┃❖┃• 40. Ｘᴅ*
*┃❖┃• 41. Ｅʀᴀꜱᴇʀ*
*┃❖┃• 42. Ｓᴜɴꜱᴇᴛ*
*┃❖┃• 43. Ｌᴇᴀꜰ*
*┃❖┃• 44. Ｇᴀʟᴀxʏ*
*┃❖┃• 45. Ｓᴀɴꜱ*
*┃❖┃• 46. Ｈᴀᴄᴋᴇʀ*
*┃❖┃• 47. Ｎɪɢᴇʀɪᴀ*
*┃❖┃• 48. Ｂᴜʟʙ*
*┃❖┃• 49. Ａɴɢᴇʟᴡɪɴɢꜱ*
*┃❖┃• 50. Ｚᴏᴅɪᴀᴄ*
*┃❖┃• 51. Ｌᴜxᴜʀʏ*
*┃❖┃• 52. Ｐᴀɪɴᴛ*
*┃❖┃• 53. Ｆʀᴏᴢᴇɴ*
*┃❖┃• 54. Ｃᴀꜱᴛʟᴇ*
*┃❖┃• 55. Ｔᴀᴛᴏᴏ*
*┃❖┃• 56. Ｖᴀʟᴏʀᴀɴᴛ*
*┃❖┃• 57. Ｂᴇᴀʀ*
*┃❖┃• 58. Ｔʏᴘᴏɢʀᴀᴘʜʏ*
*┃❖┃• 59. Ｂɪʀᴛʜᴅᴀʏ*
*┃❖└─────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━►*

*╭━━━〘 ＧＲＯＵＰ ＣＭＤＳ 〙━━━►*
*┃❖╭────────────────·๏*
*┃❖┃• 60. Ｈɪᴅᴇᴛᴀɢ*
*┃❖┃• 61. Ｔᴀɢᴀʟʟ*
*┃❖┃• 62. Ｔᴀɢɢᴘ*
*┃❖┃• 63. Ｔᴀɢ*
*┃❖┃• 64. Ａᴅᴅ*
*┃❖┃• 65. Ｒᴇᴍᴏᴠᴇ*
*┃❖┃• 66. Ｋɪᴄᴋ*
*┃❖┃• 67. Ｋɪᴄᴋᴀʟʟ*
*┃❖┃• 68. Ｓᴇᴛɢᴏᴏᴅʙʏᴇ*
*┃❖┃• 69. Ｓᴇᴛᴡᴇʟᴄᴏᴍᴇ*
*┃❖┃• 70. Ｐʀᴏᴍᴏᴛᴇ*
*┃❖┃• 71. Ｄᴇᴍᴏᴛᴇ*
*┃❖┃• 72. Ｇᴇᴛᴘɪᴄ*
*┃❖┃• 73. Ｉɴᴠɪᴛᴇ*
*┃❖┃• 74. Ｒᴇᴠᴏᴋᴇ*
*┃❖┃• 75. ＪᴏɪɴʀᴇQᴜᴇꜱᴛꜱ*
*┃❖┃• 76. Ａʟʟʀᴇᴄ*
*┃❖┃• 77. Ｍᴜᴛᴇ*
*┃❖┃• 78. Ｕɴᴍᴜᴛᴇ*
*┃❖┃• 79. Ｄᴇʟ*
*┃❖┃• 80. Ｌᴏᴄᴋɢᴄ*
*┃❖┃• 81. Ｕɴʟᴏᴄᴋɢᴄ*
*┃❖┃• 82. Ｌᴇᴀᴠᴇ*
*┃❖┃• 83. Ｕᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
*┃❖┃• 84. Ｕᴘᴅᴀᴛᴇɢᴅᴇꜱᴄ*
*┃❖┃• 85. Ｊᴏɪɴ*
*┃❖┃• 86. Ｇɪɴꜰᴏ*
*┃❖┃• 87. Ｄᴇʟᴇᴛᴇ*
*┃❖┃• 88. Ｓᴇɴᴅᴅᴍ*
*┃❖└─────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━►*

*╭━━━〘 ＳＥＴＴＩＮＧ ＣＭＤＳ 〙━━━►*
*┃❖╭───────────────────·๏*
*┃❖┃• . SᴇᴛPʀᴇꜰɪx <ᴘʀᴇꜰɪx>*
*┃❖┃• . SᴇᴛLᴏɢᴏ <ʟᴏɢᴏ ᴜʀʟ>*
*┃❖┃• . SᴇᴛJɪᴅ <ᴊɪᴅ>*
*┃❖┃• . SᴇᴛFᴏᴏᴛᴇʀ <ꜰᴏᴏᴛᴇʀ>*
*┃❖┃• . SᴇᴛOᴡɴᴇʀNʙ <ꜱᴜᴅᴏ>*
*┃❖┃• . SᴇᴛWᴀCʜᴀɴɴᴇʟ <ᴄʜᴀɴɴᴇʟ ʟɪɴᴋ>*
*┃❖┃• . OɴʟʏMᴇ <ᴏɴ/ᴏꜰꜰ>*
*┃❖┃• . OɴʟʏGʀᴏᴜᴘ <ᴏɴ/ᴏꜰꜰ>*
*┃❖└─────────────────┈⊷*
*╰━━━━━━━━━━━━━━━━━━━━━━━━━►*

> *㊛ Ꮲᴏꪝᴇʀᴅ Вʏ Cʏʙᴇʀ Lᴏᴋᴜ Aꜱʜᴜᴜ Oꜰᴄ❗*`;

        const thumb = await axios.get('https://i.ibb.co/zhvB3bLg/7535.jpg', { responseType: 'arraybuffer' });

        // Send video and status message
        await conn.sendMessage(from, {
            video: { url: 'https://files.catbox.moe/ai7kzg.mp4' },
            caption: status,
            contextInfo: {
                mentionedJid: ['94760091093@s.whatsapp.net'],
                forwardingScore: 1,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363395467876104@newsletter',
                    newsletterName: "𝐃𝐄𝐕𝐈𝐋 𝐓𝐄𝐂𝐇 𝐌𝐃",
                    serverMessageId: 999
                },
                externalAdReply: {
                    title: '𝐃𝐄𝐕𝐈𝐋 𝐓𝐄𝐂𝐇 𝐌𝐃',
                    body: 'Cʏʙᴇʀ Lᴏᴋᴜ Aꜱʜᴜᴜ Oꜰᴄ ❗',
                    mediaType: 1,
                    sourceUrl: 'https://whatsapp.com/channel/0029Vb9u0GQ8qIzmoGPEtq0s',
                    thumbnail: Buffer.from(thumb.data),
                    renderLargerThumbnail: true,
                    showAdAttribution: true
                }
            }
        }, { quoted: mek });

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/TECH-HORIZON-OWNER/PROJECT-FSD/raw/refs/heads/main/audio/AUD-20250323-WA0003.mp3' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });

    } catch (e) {
        console.error("Error in menu command:", e);
        reply(`An error occurred: ${e.message}`);
    }
});